Python - pandas 실습

In [1]:
#pandas 패키지와 실습을 위한 numpy 패키지 import
import pandas as pd
import numpy as np

In [3]:
#Series class 생성하기
obj = pd.Series([4, 5, -2, 8]) 
obj

0    4
1    5
2   -2
3    8
dtype: int64

In [4]:
#Series의 값만 확인하기 
obj.values

array([ 4,  5, -2,  8], dtype=int64)

In [5]:
#Series의 데이터타입 확인하기
obj.dtypes

dtype('int64')

In [7]:
#리스트로 인덱스 별도 지정, 반드시 " " 쌍따옴표 사용해야함
obj1 = pd.Series([4, 5, -2, 8], index=["a", "b", "c", "d"]) 
obj1

a    4
b    5
c   -2
d    8
dtype: int64

In [9]:
#딕셔너리 자료형을 Series data 생성
data = {"Kim": 35000, "Park": 67000, "Joon": 12000, "Choi": 4000}
obj2 = pd.Series(data) 
obj2

Kim     35000
Park    67000
Joon    12000
Choi     4000
dtype: int64

In [10]:
#Series 이름과 index name 지정  
obj2.name = "Salary" 
obj2.index.name = "Names" 

obj2

Names
Kim     35000
Park    67000
Joon    12000
Choi     4000
Name: Salary, dtype: int64

In [11]:
#index 이름 변경 
obj2.index = ["A", "B", "C", "D"] 
obj2

A    35000
B    67000
C    12000
D     4000
Name: Salary, dtype: int64

In [12]:
#Series 연산
obj * 10

0    40
1    50
2   -20
3    80
dtype: int64

In [13]:
#인덱싱 끼리 연산
obj1 * obj1

a    16
b    25
c     4
d    64
dtype: int64

In [14]:
#values 값끼리 연산
obj1.values + obj.values

array([ 8, 10, -4, 16], dtype=int64)

In [28]:
#Sereis 인덱싱
a = pd.Series([1024, 2048, 3096, 6192],
              index=["서울", "부산", "인천", "대구"])
print(a, "\n") #Sereis 출력
print(a[1], a["부산"], "\n") #인덱스 값이 1인 값과 label 값이 부산인 값 비교
print(a[[0, 3, 1]]) #인덱스 값 0, 3, 1순으로 출력
a[["서울", "대구", "부산"]] #label 값 서울, 대구, 부산순으로 출력

서울    1024
부산    2048
인천    3096
대구    6192
dtype: int64

2048 2048

서울    1024
대구    6192
부산    2048
dtype: int64

서울    1024
대구    6192
부산    2048
dtype: int64

In [22]:
#라벨 값이 영문 문자열인 경우에는 마치 속성인것처럼 점(.)을 이용하여 접근
obj2.A

35000

In [25]:
#Series 슬라이싱
print(a[1:3], "\n") #배열 인덱싱
print(a["부산":"대구"]) #라벨 인덱싱

부산    2048
인천    3096
dtype: int64

부산    2048
인천    3096
대구    6192
dtype: int64

In [37]:
#데이터 갱신
a = pd.Series([1024, 2048, 3096, 6192],
              index=["서울", "부산", "인천", "대구"])
print(a, "\n") #기존 데이터
a["부산"] = 1234
print(a) #갱신 후 데이터

서울    1024
부산    2048
인천    3096
대구    6192
dtype: int64

서울    1024
부산    1234
인천    3096
대구    6192
dtype: int64

In [38]:
#데이터 삭제
a = pd.Series([1024, 2048, 3096, 6192],
              index=["서울", "부산", "인천", "대구"])
print(a, "\n") #기존 데이터
del a["서울"]
print(a) #삭제 후 데이터

서울    1024
부산    2048
인천    3096
대구    6192
dtype: int64

부산    2048
인천    3096
대구    6192
dtype: int64

In [39]:
#데이터 프레임 생성
data = {
'name': ["Choi", "Choi", "Choi", "Kim", "Park"], 
'year': [2013, 2014, 2015, 2016, 2017], 
'points': [1.5, 1.7, 3.6, 2.4, 2.9]
} 
df = pd.DataFrame(data) 
df

   name  year  points
0  Choi  2013     1.5
1  Choi  2014     1.7
2  Choi  2015     3.6
3   Kim  2016     2.4
4  Park  2017     2.9

In [40]:
#행 방향의 index 확인
df.index

RangeIndex(start=0, stop=5, step=1)

In [41]:
#열 방향의 index 확인
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [43]:
#데이터 프레임 값 확인
df.values

array([['Choi', 2013, 1.5],
       ['Choi', 2014, 1.7],
       ['Choi', 2015, 3.6],
       ['Kim', 2016, 2.4],
       ['Park', 2017, 2.9]], dtype=object)

In [45]:
#데이터 프레임에 penalty 열 추가
df = pd.DataFrame(data, columns=["year", "name", "points", "penalty"],
                                  index=(["one", "two", "three", "four", "five"]))
df

       year  name  points penalty
one    2013  Choi     1.5     NaN
two    2014  Choi     1.7     NaN
three  2015  Choi     3.6     NaN
four   2016   Kim     2.4     NaN
five   2017  Park     2.9     NaN

In [46]:
# 특정 열만 선택
df[["year","points"]]

       year  points
one    2013     1.5
two    2014     1.7
three  2015     3.6
four   2016     2.4
five   2017     2.9

In [47]:
#추가한 penalty 열 선택 후 값 1.0 대입 
df["penalty"] = 1.0
df

       year  name  points  penalty
one    2013  Choi     1.5      1.0
two    2014  Choi     1.7      1.0
three  2015  Choi     3.6      1.0
four   2016   Kim     2.4      1.0
five   2017  Park     2.9      1.0

In [48]:
#python의 리스트로도 대입 가능
df['penalty'] = [0.1, 0.2, 0.3, 0.4, 0.5] 
df

       year  name  points  penalty
one    2013  Choi     1.5      0.1
two    2014  Choi     1.7      0.2
three  2015  Choi     3.6      0.3
four   2016   Kim     2.4      0.4
five   2017  Park     2.9      0.5

In [62]:
#numpy의 np.arange로도 새로운 열을 추가 가능
df['zeros'] = np.arange(5) 
print(df, "\n") #numpy의 np.arange로도 새로운 열을 추가 가능 

val = pd.Series([-1.2, -1.5, -1.7], index=['two','four','five']) 
df['debt'] = val 
print(df, "\n") #index인자로 특정행을 지정하여 시리즈(Series)로도 추가 가능

df["net_points"] = df["points"] - df["penalty"]
print(df, "\n") #연산 결과를 새로운 열에 추가하기

df["high_points"] = df["net_points"] > 2.0 
print(df, "\n") #조건 연산 후 열 추가

Info   year  name  points  penalty  debt  zeros  net_points
Order
one    2013  Choi     1.5      0.1   NaN      0         1.4
two    2014  Choi     1.7      0.2  -1.2      1         1.5
three  2015  Choi     3.6      0.3   NaN      2         3.3
four   2016   Kim     2.4      0.4  -1.5      3         2.0
five   2017  Park     2.9      0.5  -1.7      4         2.4

Info   year  name  points  penalty  debt  zeros  net_points
Order
one    2013  Choi     1.5      0.1   NaN      0         1.4
two    2014  Choi     1.7      0.2  -1.2      1         1.5
three  2015  Choi     3.6      0.3   NaN      2         3.3
four   2016   Kim     2.4      0.4  -1.5      3         2.0
five   2017  Park     2.9      0.5  -1.7      4         2.4

Info   year  name  points  penalty  debt  zeros  net_points
Order
one    2013  Choi     1.5      0.1   NaN      0         1.4
two    2014  Choi     1.7      0.2  -1.2      1         1.5
three  2015  Choi     3.6      0.3   NaN      2         3.3
four   2016   Kim     2.4      0.4  -1.5      3         2.0
five   2017  Park     2.9      0.5  -1.7      4         2.4

Info   year  name  points  penalty  debt  zeros  net_points  high_points
Order
one    2013  Choi     1.5      0.1   NaN      0         1.4        False
two    2014  Choi     1.7      0.2  -1.2      1         1.5        False
three  2015  Choi     3.6      0.3   NaN      2         3.3         True
four   2016   Kim     2.4      0.4  -1.5      3         2.0        False
five   2017  Park     2.9      0.5  -1.7      4         2.4         True

In [54]:
#열 삭제하기 
del df["high_points"]
del df["net_points"] 
del df["zeros"] 
df

       year  name  points  penalty  debt
one    2013  Choi     1.5      0.1   NaN
two    2014  Choi     1.7      0.2  -1.2
three  2015  Choi     3.6      0.3   NaN
four   2016   Kim     2.4      0.4  -1.5
five   2017  Park     2.9      0.5  -1.7

In [56]:
#index와 columns 이름 지정
df.index.name = "Order" 
df.columns.name = "Info" 
df

Info   year  name  points  penalty  debt
Order
one    2013  Choi     1.5      0.1   NaN
two    2014  Choi     1.7      0.2  -1.2
three  2015  Choi     3.6      0.3   NaN
four   2016   Kim     2.4      0.4  -1.5
five   2017  Park     2.9      0.5  -1.7

In [59]:
#데이터 프레임의 열 인덱싱
print(df["year"], "\n") 
print(df.year) #다른 방법의 데이터 프레임 열 인덱싱

Order
one      2013
two      2014
three    2015
four     2016
five     2017
Name: year, dtype: int64

Order
one      2013
two      2014
three    2015
four     2016
five     2017
Name: year, dtype: int64

In [58]:
#다른 방법의 데이터 프레임 열 인덱싱
df.year

Order
one      2013
two      2014
three    2015
four     2016
five     2017
Name: year, dtype: int64

In [63]:
#행 인덱싱은 슬라이싱으로 0번째부터 1번째로 지정하면 1행을 반환
df[0:1]

Info   year  name  points  penalty  debt  zeros  net_points  high_points
Order
one    2013  Choi     1.5      0.1   NaN      0         1.4        False

In [64]:
# .loc 함수를 사용하여 시리즈로 인덱싱, 인덱스의 라벨값 기반 인덱싱
df.loc["two"]

Info
year            2014
name            Choi
points           1.7
penalty          0.2
debt            -1.2
zeros              1
net_points       1.5
high_points    False
Name: two, dtype: object

In [66]:
# .loc 또는 .iloc 함수를 사용하여 데이터프레임으로 인덱싱
df.loc["two":"four"]

Info   year  name  points  penalty  debt  zeros  net_points  high_points
Order
two    2014  Choi     1.7      0.2  -1.2      1         1.5        False
three  2015  Choi     3.6      0.3   NaN      2         3.3         True
four   2016   Kim     2.4      0.4  -1.5      3         2.0        False

In [73]:
df.loc[:,'year'] # == df['year’]

Order
one      2013.0
two      2014.0
three    2015.0
four     2016.0
five     2017.0
six         NaN
Name: year, dtype: float64

In [74]:
df.loc["three":"five","year":"penalty"]

Info     year  name  points  penalty
Order
three  2015.0  Choi     3.6      0.3
four   2016.0   Kim     2.4      0.4
five   2017.0  Park     2.9      0.5

In [76]:
#iloc 인덱싱, 인덱스의 숫자 기반 인덱싱
df.iloc[3]

Info
year           2016.0
name              Kim
points            2.4
penalty           0.4
debt             -1.5
zeros             3.0
net_points        2.0
high_points     False
Name: four, dtype: object

In [77]:
#슬라이싱으로 지정하여 반환
df.iloc[3:5, 0:2]

Info     year  name
Order
four   2016.0   Kim
five   2017.0  Park

In [78]:
#각각의 행과 열을 지정하여 반환하기
df.iloc[[0,1,3], [1,2]]

Info   name  points
Order
one    Choi     1.5
two    Choi     1.7
four    Kim     2.4

In [79]:
#행을 전체, 열은 두번째열부터 마지막까지 슬라이싱으로 지정하여 반환
df.iloc[:,1:4]

Info   name  points  penalty
Order
one    Choi     1.5      0.1
two    Choi     1.7      0.2
three  Choi     3.6      0.3
four    Kim     2.4      0.4
five   Park     2.9      0.5
six     NaN     NaN      NaN

In [80]:
#Boolean 인덱싱
df #df 확인

Info     year  name  points  penalty  debt  zeros  net_points high_points
Order
one    2013.0  Choi     1.5      0.1   NaN    0.0         1.4       False
two    2014.0  Choi     1.7      0.2  -1.2    1.0         1.5       False
three  2015.0  Choi     3.6      0.3   NaN    2.0         3.3        True
four   2016.0   Kim     2.4      0.4  -1.5    3.0         2.0       False
five   2017.0  Park     2.9      0.5  -1.7    4.0         2.4        True
six       NaN   NaN     NaN      NaN   NaN    NaN         NaN         NaN

In [81]:
#year가 2014보다 큰 boolean data 
df["year"] > 2014

Order
one      False
two      False
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [83]:
#name이 Choi인 사람의 name, point 값 출력
df.loc[df['name'] == "Choi", ['name','points']]

Info   name  points
Order
one    Choi     1.5
two    Choi     1.7
three  Choi     3.6

In [84]:
#numpy에서와 같이 논리연산을 응용 가능. 
df.loc[(df["points"] > 2) & (df["points"]<3), :]

Info     year  name  points  penalty  debt  zeros  net_points high_points
Order
four   2016.0   Kim     2.4      0.4  -1.5    3.0         2.0       False
five   2017.0  Park     2.9      0.5  -1.7    4.0         2.4        True

In [85]:
# DataFrame을 만들때 index, column을 설정하지 않으면 기본값으로 0부터 시작하는 정수형 숫자로 입력된다. 
df = pd.DataFrame(np.random.randn(6,4)) 
df

          0         1         2         3
0  0.843134 -0.292331 -0.036254  1.360505
1 -0.093411 -1.251340 -0.938361 -1.574806
2 -0.477276  0.603332 -0.144123  0.282298
3 -1.840545  0.263544 -0.813880 -0.215897
4 -0.354693  0.396254  0.561136  1.169666
5 -1.933788  0.900496  0.303236  0.529268

In [87]:
#columns 값 지정
df.columns = ["A", "B", "C", "D"] 
df

          A         B         C         D
0  0.843134 -0.292331 -0.036254  1.360505
1 -0.093411 -1.251340 -0.938361 -1.574806
2 -0.477276  0.603332 -0.144123  0.282298
3 -1.840545  0.263544 -0.813880 -0.215897
4 -0.354693  0.396254  0.561136  1.169666
5 -1.933788  0.900496  0.303236  0.529268

In [95]:
#pandas에서 제공하는 date range함수는 datetime 자료형으로 구성된, 날짜/시간 함수 
df.index = pd.date_range('20220701', periods=6) 
print(df.index) #2022-07.01부터 추가한 6개의 데이트 값 확인
df

DatetimeIndex(['2022-07-01', '2022-07-02', '2022-07-03', '2022-07-04',
               '2022-07-05', '2022-07-06'],
              dtype='datetime64[ns]', freq='D')

                   A         B         C         D
2022-07-01  0.843134 -0.292331 -0.036254  1.360505
2022-07-02 -0.093411 -1.251340 -0.938361 -1.574806
2022-07-03 -0.477276  0.603332 -0.144123  0.282298
2022-07-04 -1.840545  0.263544 -0.813880 -0.215897
2022-07-05 -0.354693  0.396254  0.561136  1.169666
2022-07-06 -1.933788  0.900496  0.303236  0.529268

In [101]:
#numpy로 결측치 다루기, np.nan은 NaN값을 의미
df["F"] = [1.0, np.nan, 3.5, 6.1, np.nan, 7.0] 
df

                   A         B         C         D    F
2022-07-01  0.843134 -0.292331 -0.036254  1.360505  1.0
2022-07-02 -0.093411 -1.251340 -0.938361 -1.574806  NaN
2022-07-03 -0.477276  0.603332 -0.144123  0.282298  3.5
2022-07-04 -1.840545  0.263544 -0.813880 -0.215897  6.1
2022-07-05 -0.354693  0.396254  0.561136  1.169666  NaN
2022-07-06 -1.933788  0.900496  0.303236  0.529268  7.0

In [104]:
#dropna 함수는 값이 nan인 경우 그 행을 제거, 파라미터 how의 default 값은 any 
df.dropna()

                   A         B         C         D    F
2022-07-01  0.843134 -0.292331 -0.036254  1.360505  1.0
2022-07-03 -0.477276  0.603332 -0.144123  0.282298  3.5
2022-07-04 -1.840545  0.263544 -0.813880 -0.215897  6.1
2022-07-06 -1.933788  0.900496  0.303236  0.529268  7.0

In [105]:
#파라미터 how의 값을 all 지정해주면 모든 값이 nan인 경우만 그 행을 제거
df.dropna(how='all')

                   A         B         C         D    F
2022-07-01  0.843134 -0.292331 -0.036254  1.360505  1.0
2022-07-02 -0.093411 -1.251340 -0.938361 -1.574806  NaN
2022-07-03 -0.477276  0.603332 -0.144123  0.282298  3.5
2022-07-04 -1.840545  0.263544 -0.813880 -0.215897  6.1
2022-07-05 -0.354693  0.396254  0.561136  1.169666  NaN
2022-07-06 -1.933788  0.900496  0.303236  0.529268  7.0

In [106]:
#fillna를 통해 NaN에 특정 value 값 넣기
df.fillna(value=0.5)

                   A         B         C         D    F
2022-07-01  0.843134 -0.292331 -0.036254  1.360505  1.0
2022-07-02 -0.093411 -1.251340 -0.938361 -1.574806  0.5
2022-07-03 -0.477276  0.603332 -0.144123  0.282298  3.5
2022-07-04 -1.840545  0.263544 -0.813880 -0.215897  6.1
2022-07-05 -0.354693  0.396254  0.561136  1.169666  0.5
2022-07-06 -1.933788  0.900496  0.303236  0.529268  7.0

In [114]:
#특정 행 drop하기 
print(df.drop(pd.to_datetime('20220701')), "\n")

# 2개 이상도 가능 
print(df.drop([pd.to_datetime('20220702'),pd.to_datetime('20220704')]))

                   A         B         C         D    F
2022-07-02 -0.093411 -1.251340 -0.938361 -1.574806  NaN
2022-07-03 -0.477276  0.603332 -0.144123  0.282298  3.5
2022-07-04 -1.840545  0.263544 -0.813880 -0.215897  6.1
2022-07-05 -0.354693  0.396254  0.561136  1.169666  NaN
2022-07-06 -1.933788  0.900496  0.303236  0.529268  7.0

                   A         B         C         D    F
2022-07-01  0.843134 -0.292331 -0.036254  1.360505  1.0
2022-07-03 -0.477276  0.603332 -0.144123  0.282298  3.5
2022-07-05 -0.354693  0.396254  0.561136  1.169666  NaN
2022-07-06 -1.933788  0.900496  0.303236  0.529268  7.0

In [116]:
#특정 열 삭제하기 
print(df.drop('F', axis = 1), "\n")

# 2개 이상의 열도 가능 
print(df.drop(['B','D'], axis = 1) , "\n")

                   A         B         C         D
2022-07-01  0.843134 -0.292331 -0.036254  1.360505
2022-07-02 -0.093411 -1.251340 -0.938361 -1.574806
2022-07-03 -0.477276  0.603332 -0.144123  0.282298
2022-07-04 -1.840545  0.263544 -0.813880 -0.215897
2022-07-05 -0.354693  0.396254  0.561136  1.169666
2022-07-06 -1.933788  0.900496  0.303236  0.529268

                   A         C    F
2022-07-01  0.843134 -0.036254  1.0
2022-07-02 -0.093411 -0.938361  NaN
2022-07-03 -0.477276 -0.144123  3.5
2022-07-04 -1.840545 -0.813880  6.1
2022-07-05 -0.354693  0.561136  NaN
2022-07-06 -1.933788  0.303236  7.0

In [118]:
#pandas 데이터 불러오기
pd.read_csv('sample1.csv')

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [119]:
#c1을 인덱스로 불러오기
pd.read_csv('sample1.csv', index_col="c1")

      c2     c3
c1
1   1.11    one
2   2.22    two
3   3.33  three

In [120]:
#pandas를 사용해서 sample6.csv로 데이터 쓰기
df.to_csv("sample6.csv")

In [122]:
#np.random으로 시리즈 생성
s = pd.Series(np.random.randint(6, size=100))
s.head()

0    0
1    4
2    0
3    0
4    0
dtype: int32

In [123]:
#value_counts 메서드로 값마다 가지고 있는 개수 카운트
s.value_counts()

1    23
5    18
2    18
4    15
0    13
3    13
dtype: int64

In [124]:
# sort_index 메서드로 정렬하기
s.value_counts().sort_index()

0    13
1    23
2    18
3    13
4    15
5    18
dtype: int64

In [125]:
# ascending=False 인자로 내림차순 정리
s.sort_values(ascending=False)

99    5
81    5
61    5
18    5
68    5
     ..
71    0
24    0
43    0
34    0
0     0
Length: 100, dtype: int32

In [126]:
#apply 함수와 lambda 함수

#실습용 데이터 프레임 생성
df = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [127]:
#람다 함수 사용해서 열에서 가장 큰 값과 작은 값 뺼셈 수행
df.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [128]:
#행에 대해 적용하고 싶으면 axis=1 인수 사용
df.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [129]:
#apply 함수로 value_counts로 값의 수를 반환
df.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [130]:
#NaN 결측치는 fillna()를 통해 채울 수 있음, astype(int)로 정수형으로 변환
df.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [131]:
#describe() 함수는 데이터 프레임의 통계값들을 보여줌
df.describe()

              A        B         C
count  5.000000  5.00000  5.000000
mean   3.000000  2.20000  3.200000
std    1.224745  0.83666  1.643168
min    1.000000  1.00000  1.000000
25%    3.000000  2.00000  2.000000
50%    3.000000  2.00000  4.000000
75%    4.000000  3.00000  4.000000
max    4.000000  3.00000  5.000000

In [132]:
#pd.to_datetime 함수
date_str = ["2022, 7, 1", "2022, 7, 4", "2022, 7, 5", "2022, 1, 6"]

idx = pd.to_datetime(date_str)
idx

DatetimeIndex(['2022-07-01', '2022-07-04', '2022-07-05', '2022-01-06'], dtype='datetime64[ns]', freq=None)

In [137]:
#pd.to_datetime을 indxe로 사용하고 random.seed의 난수를 값으로 사용해 데이터 프레임 생성
np.random.seed(0)

s = pd.Series(np.random.randn(4), index=idx)
s

2022-07-01    1.764052
2022-07-04    0.400157
2022-07-05    0.978738
2022-01-06    2.240893
dtype: float64

In [136]:
#pd.date_range 함수
pd.date_range("2022-7-1", "2022-7-5")
#== pd.date_range(start="2022-7-1", periods=5)

DatetimeIndex(['2022-07-01', '2022-07-02', '2022-07-03', '2022-07-04',
               '2022-07-05'],
              dtype='datetime64[ns]', freq='D')